[{
    "name": "America Shad",
    "id": 0,
    "scientific name": "Alosa sapidissima",
    "category": "Anadromous",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FAmerican_shad&psig=AOvVaw3SMjCrNNo_Jg-OVtg8MNi-&ust=1616270211138000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCIiDmPCRve8CFQAAAAAdAAAAABAD",
    "description": ["American shad are anadromous and native to the East coast of North America. Due to introductions into the Sacramento and Columbia Rivers in the early 1900s, they are now found all along the West coast of North America. During the summer months, spawning adults can be encountered in estuaries of major river systems in British Columbia, such as the Fraser River. While they can be quite big in their native watersheds, American shad found on the West coast are usually quite small, around 12 inches or less in length."],
    "location":[],
    "technique":[]
},

{
    "name": "Back Rockfish",
    "id": 1,
    "scientific name": "Sebastes melanops",
    "category": "Saltwater",
    "image":"https://www.google.com/url?sa=i&url=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FBlack_rockfish&psig=AOvVaw3S3YmF8Hm_niVT3x6N6Fht&ust=1616271150860000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCLiLr7CVve8CFQAAAAAdAAAAABAD",
    "description": ["Black rockfish is a rockfish species found in the coastal waters of British Columbia. Their primary habitat is kelp beds, where they feed on baitfish. Black rockfish can be targeted by fly fishing or jigging with artificial lures. They are easy to catch because they are aggressive predators. Average size of black rockfish ranges between 2 and 6lb, while larger fish are available in deeper waters."],
    "location":[],
    "technique":[]
} , 

{
    "name": "Brook Trout",
    "id": 2,
    "scientific name": "Salvelinus fontinalis",
    "category": "Freshwater",
    "image":"https://www.google.com/url?sa=i&url=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FBrook_trout&psig=AOvVaw3qiqPse6c1tuGc_uKBa8Uv&ust=1616271708783000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCNCXorqXve8CFQAAAAAdAAAAABAe",
    "description": ["Brook trout are also known as brook char or Eastern brook trout. Native to Eastern North America, they have been introduced in British Columbia and stocked in a number of lakes where anglers enjoy targeting them in the summer months on both fly and bait rods. In the winter months, they are also regularly targeted by ice fishermen.",
                    "Brook trout are released into lakes by Freshwater Fisheries Society of BC when they are yearlings. Average size of brook trout ranges between 1 and 4lb, while larger fish are available in lakes where they survive through several winters. Although they do not jump like rainbow trout, they still put up a strong fight on the line by diving deeply with their thick body. These fish do not grow very long, but they make up for it by their large girth.",
                    "Brook trout will attack spoons and spinners often, so you can catch them by simply casting and retrieving a lure with a light spinning tackle. In the winter months, brook trout are caught by dangling a piece of bait such as dew worm, single egg, deli shrimp and krill. Fly fishing in spring can be very effective when targeting these fish. A size 10 to 14 chironomid which matches the hatch can be extremely productive when dangled under a strike indicator at the right depth. Dragonfly nymph and leech patterns being stripped in slowly can also attract fish.",
                    "Brook trout are known for their excellent eating quality, but fish caught in the summer months can be muddy so the best time to harvest them is in winter and spring."],
    "location":[],
    "technique":[]
}  ,

{
    "name": "Bull Trout",
    "id": 3,
    "scientific name": "Salvelinus confluentus",
    "category": "Anadromous, freshwater",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.fws.gov%2Ffisheries%2Ffreshwater-fish-of-america%2Fbull_trout.html&psig=AOvVaw3HA7KxC7mk3jsBWvBjIY9N&ust=1616272502832000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCMivgbWave8CFQAAAAAdAAAAABAS",
    "description": ["Although not as well known as salmon and trout, bull trout can actually be found in many rivers and lakes across British Columbia. In recent years, conservation effort has resulted in the great comeback of this magnificent species. Once regarded as pests due to their predatory threats on salmon populations, bull trout are now popular gamefish among anglers. They are characterized by beautiful spots along the entire body. If you fish the Fraser River frequently during spring and fall or salmon bearing streams during winter, most likely you have encountered a few bull trout. In coastal watersheds, bull trout are both competitors and predators of pacific salmon. It is a mysterious species that is often confused with the dolly varden, a species that closely resembles a bull trout morphologically yet they are distant relatives."],
    "location": ["Except Vancouver Island, bull trout can be found in just about every stream and lake in British Columbia. In Southern BC, there are many fishing locations where you can catch bull trout. Usually, at any barfishing locations along the Fraser River you will encounter them when fishing for salmon. During late fall and early spring, try fishing the Tidal Fraser and Pitt Rivers.", 
                "In the winter months, you can also try streams where bull trout feed on salmon eggs. Streams such as the Squamish River, Cheakamus River, Upper Pitt River, Coquitlam River, Chilliwack River and Harrison River provide good fishing for bull trout. These fish are found in the estuaries during spring when salmon fry start their migration into the Pacific Ocean.",
                "Lakes and streams in the Kootenay and Okanagan regions also provide good bull trout fishing. These predatory fish tend to be larger as they feed on small resident rainbow and cutthroat trout in these two regions."],
    "technique": ["When fishing for bull trout in the Tidal Fraser River, you can either use bait (if a bait ban is not in effect) or lures. Small spoons and spinners that immitate juvenile salmon and other baitfish work great between April and June, while a hook baited with roe is effective between September and December when salmon return to spawn.",
                "When fishing for bull trout in streams, float fishing with egg patterns can work great during the salmon season. Spoons and spinners never fail because the vibration is difficult to resist for a bull trout. Once salmon spawning takes place, flyfishing with either egg or flesh patterns usually work well. Once juvenile salmon begin to emerge, minnow patterns should be used due to a shift in bull trout's diet.",
                "Bull trout are not targeted specifically in the ocean due to their low abundance. Occasionally feeding fish can be caught near estuaries, kelp beds and other structures."]
}  ,

{
    "name": "Cabezone",
    "id": 4,
    "scientific name": "Scorpaenichthys marmoratus",
    "category": "Saltwater",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.digopaul.com%2Fenglish-word%2Fcabezone.html&psig=AOvVaw2Dij0Mp7j1H2l1L0wnW_yj&ust=1616272652380000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCJjmmfyave8CFQAAAAAdAAAAABAv",
    "description": ["Cabezone is a large species of sculpin found along the West coast of North America, between Northern British Columbia and Southern California. They primarily reside in kelp beds and rocks, where they can prey on small fish, crustaceans and feed on mollusks. They can be identified by their brown body colour, the broad square tail, the eleven spines along the dorsal part of the body and a stout spine before the eyes. While they are not prime target fish by anglers in British Columbia, their eating quality is in fact very good. Cabezone can be caught by bottom fishing with cut bait or jigs. Most cabezone are in the several pound range, while fish up to 20lb have been recorded in the past."],
    "location":[],
    "technique":[]
}  ,

{
    "name": "Chinook Salmon",
    "id": 5,
    "scientific name": "Oncorhynchus tshawytscha",
    "category":"Saltwater",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.seafoodsource.com%2Fseafood-handbook%2Ffinfish%2Fsalmon-chinook&psig=AOvVaw1qkYK_yNr8M4oBpVS5q2wJ&ust=1616272885253000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCJiJ1u-bve8CFQAAAAAdAAAAABAP",
    "description": ["Chinook salmon are more commonly known as a 'kings' in USA or 'springs' in Canada. Fish that weigh over 30lb are also known as 'tyees'. It is the largest species in the pacific salmon family. They are widely targeted by both freshwater and saltwater sportfishermen in British Columbia due to their size, robust strength and fine taste."],
    "location": ["Chinook salmon are targeted in the ocean during the final few months of their ocean phase, when they stage and enter the river. Between May and September, saltwater anglers prefer to fish for chinook salmon on the West Coast of British Columbia, where they feed aggressively on baitfish such as herring and anchovy.",
                "Jack chinook salmon are males that return to their natal streams one year earlier than other adults. Jacks are categorized as either fish that are under 62cm or 50cm, depending on which natal stream the fish return to. Jacks tend to have larger spots than full-grown adults."],
    "technique": ["There are numerous techniques that can be used for chinook salmon and it depends on your fishing location. In the ocean, chinook salmon are taken by trolling baitfish, hootchies, spoons and plastic bait. Mooching and lure jigging are also two popular techniques employed by saltwater anglers. Timing and depth selection are important keys whenyou are attempting to find a school of chinook salmon.",
                "In large rivers such as the Fraser River, they are taken by barfishing with a large spin n glow. The spin n glow is anchored by the large weight on the river bed and spun by the river current, causing fish to strike as they swim up to it",
                "In smaller tributaries where chinook salmon return to spawn, they can be caught by lure casting or float fishing. Popular bait or presentations used under a float in rivers include roe, shrimp and wool in various colours. Big spoons and jigs are common lures used when lure casting for them. Fish are generally found in deep runs and pools, especially on bright days when they need to find structures for protection."]
}  ,

{
    "name": "Chub Mackerel",
    "id": 6,
    "scientific name": "Scomber japonicus",
    "category": "Saltwater",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fthisfish.info%2Ffishery%2Fspecies%2Fatlantic-chub-mackerel%2F&psig=AOvVaw0XiiL7iMcgM2l2GVs6ZtCv&ust=1616287381026000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCOi9pfLRve8CFQAAAAAdAAAAABA2",
    "description": ["Chub mackerel, also known as Pacific chub mackerel, is a coastal pelagic species found in the Pacific and Indian Ocean. From the very early stage of their life, chub mackerel travel in large schools. Their range of habitat is mainly subtropical, but during years when warm current surges in North Pacific Ocean, they can be found along the coast of British Columbia.",
                    "Their adult sizes vary from 30cm to 60cm in length. Due to their highly predatory nature, they can be a problem for juvenile Pacific salmon that are making their way into the ocean. Their primary diet is made of small fish, crustaceans and copepods. Squid is a commonly eaten item for these fish.",
                    "They can be caught by using bait, small lures and flies. At times they become accidental by-catches when trolling for salmon, which can be a nuisance. On light tackle, they can be very entertaining. Chub mackerel are eaten in various parts of the world. They can be fried, broiled, or smoked."],
    "location":[],
    "technique":[]
}  ,

{
    "name": "Chum Salmon",
    "id": 7,
    "scientific name": "Oncorhynchus keta",
    "category": "Anadromous",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.salmonfishingnow.com%2Fchum-salmon-biology%2F&psig=AOvVaw3mKZkcqdiuRg1P-12URPtE&ust=1616287655624000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCJDZufvSve8CFQAAAAAdAAAAABAJ",
    "description": ["Also known as 'dog salmon' due to their canine appearance during the spawning phase, chum salmon are one of the favourite target species among anglers due to their high abundance and powerful strength. Although they are not known as a great table fish, they are economically important as they make up a large portion of the commercial catches each year."],
    "location":["In the Lower Mainland, chum salmon make their annual return into the river between October and December. During this period, they can be caught in any rivers that have a strong run. These rivers include Stave River, Squamish River, Cheakamus River, Vedder River, Harrison River, Cheahalis River, Indian River and many other sloughs in the Fraser Valley. They can also be caught by barfishing along the Fraser River. Prior to entering the river, boat anglers can enjoy catching them by trolling in the ocean. In other parts of BC, they can pretty much be found in every salmon spawning river. Be sure to check the fishing regulations for openings and daily quotas of chum salmon before heading out."],
    "technique":["Chum salmon can be caught with ease if you are fishing at the right place and time. To successfully bring the fish in is another story. To ensure that you will not lose the fish, it is important that you use proper tackle. Heavy enough rod, reel and line can not only put up with the strong fight, it also reduces fighting time to ensure the survival of the fish when released. Chum salmon can be caught with various techniques, these include driftfishing with a float, bottom bouncing, spinning with spoons or spinners in rivers, trolling in the ocean with hootchies. Typical colours used for chum salmon include green, chartreuse, pink, peach, orange and purple."]
}  ,

{
    "name": "Coastal Cutthroat Trout",
    "id": 8,
    "scientific name": "Oncorhynchus clarki clarki",
    "category": "Anadromous, freshwater",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.fws.gov%2Foregonfwo%2Farticles.cfm%3Fid%3D149489425&psig=AOvVaw1X0SrXv8sxG7Z9eLoIBNf2&ust=1616290417107000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCNjx1KLdve8CFQAAAAAdAAAAABAD",
    "description": ["Average length of coastal cutthroat trout ranges between 10 to 16 inches. Large fish up to 20 inches are not rare in certain regions, and the odd fish bigger than 20 inches have been reported in the past. Their distinct characteristic is the orange slash on the bottom of each gill plate. Their back is generally blue or green, and body is heavily spotted. Newly arrived fish from the ocean usually have a silver body. Their lower fins are yellow and gill plates are pink. Adults turn orange when spawning."],
    "location":["Coastal cutthroat trout can be found in streams around early fall and spring. During this period, these fish aggressively feed on salmon eggs (fall) and juveniles (spring). there are not too many 'prime' cutthroat locations as these fish are highly mobile. To increase your chance of finding them, fish around creek mouths, sloughs, brackish water and estuaries. During certain time of the year, coastal cutthroat trout can also be found in sheltered bays and kelp beds."],
    "technique":["Those who target coastal cutthroat trout often describe the process as looking for a needle in the hay stack. Cutthroat trout are opportunists and their whereabouts are usually determined by the locations of food. With some background research and good timing, your chance of finding a school of feeding cutties would increase. Cutthroat trout can be taken on both fly gear and spincasting setup. When flyfishing, a small minnow pattern that is slowly retrieved below the surface can trigger a bite. Spincasters can either use lures or bait such as worm or roe. Effective lures include small (1/4oz or less) silver spoons or spinners with blue or orange stripes.",
                "One cautious note regarding baitfishing for cutthroat trout. Coastal cutties are aggressive feeders, and they do not hesitate when bait is presented in front of them. If catch and release is being practiced, it's best to avoid using bait as the fish may swallow the hook easily."]

}  ,

{
    "name": "Coho Salmon",
    "id": 9,
    "scientific name": "Oncorhyncus kisutch",
    "category":"Anadromous",
    "image" :"https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.fws.gov%2Ffisheries%2Ffreshwater-fish-of-america%2Fcoho_salmon.html&psig=AOvVaw1OeI9FZ7Jy3fP3bNaN6qWa&ust=1616291460475000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCNChuJbhve8CFQAAAAAdAAAAABAD",
    "description": ["Coho salmon have many distinct features that separate them from other members of the pacific salmon species. Small rearing juveniles have parr marks that run across their entire body. They have white gums, black tongues and numerous small spots along their back. During the ocean phase, their body is silver in colour, with a blue metallic back. Their square tail has a wide base that is scattered with some spots, normally on the upper portion.",
                    "Adults' average weight ranges between 4lb to 15lb, but fish beyond this range are not rare, especially in Northern BC and Alaska. Small prematured spawning males between 25cm and 35cm in length are known as 'jacks', which return to their natal streams one year earlier than other adults. During spawning, adult males develop a distinct 'hooked nose'. Body colouration during spawning is red."],
    "location":["Coho salmon are both targeted in the ocean and rivers. In the ocean, they are generally found along the kelp beds where they constantly feed on small baitfish species such as the needlefish and herring. They are also fished at river mouths where they stage prior to entering their natal streams. In freshwater, coho salmon are targeted in sloughs and streams where they hold before entering their spawning stage."],
    "technique":["There are many techniques that can be used to target coho salmon. These include trolling, mooching, bucktailing in the ocean, barfishing in large river systems, spincasting and flyfishing in estuaries and sloughs, float fishing in rivers. All of these techniques have their own advantages and excitement.",
                "Common freshwater lures used for coho salmon include spoons, spinners that are silver or copper in colour. Bait used for drifting include freshly cured roe and dew worms. Artificial presentations such as wool, corkies, spin n' glow are also very effective at times."]
}  ,

{
    "name": "Common Carp",
    "id": 10,
    "scientific name": "Cyprinus carpio",
    "category": "Freshwater",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.pinterest.com%2Fpin%2F40110252921452008%2F&psig=AOvVaw1nGKwdTcvb_-zBxCLQjldQ&ust=1616291855123000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCID0is_ive8CFQAAAAAdAAAAABAD",
    "description": ["The common carp is characterized by the thick and large scales that cover its entire body. Its back is dominated by a long dorsal fin that includes 3 to 4 spines at the beginning. Its size, shape, colour and fin development can vary greatly due to its diet and habitat. Some varieties can be elongated and slim, while others can appear broad and sluggish. Its colour ranges from grey to golden. Another distinctive characteristic that can be used to identify a carp is its protruded jaw. This evolutionary product allows a carp to extend its jaw and suck in food and water. A carp can grow to a tremendous size within a short period of time. Fish between 1lb and 10lb are not uncommon. In parts of Europe and Asia, fish beyond 50lb are a norm."],
    "location":["In the summer, carp can be found in shallow waters along lake shorelines, canals, small ponds and brackish water. Look for heavily weeded area, slow moving and turbid water. In winter time, carp prefers deeper, warmer waters."],
    "technique":["Carp fishing requires patience and finesse. Finely presented bait and delicate fishing gear is often required to entice a cautious carp. There are several fishing techniques that can be employed, depends on the type of water that one is fishing in. Float fishing is by far the most popular method. A small float that is well balanced by a few split shots above a small hook is the typical setup. Adjust the float depth so that the baited hook is sitting on the bottom. When a carp bites, the float will begin to move slowly as it carries the bait away. Instead of striking immediately, hold back and set the hook when the fish has finally committed to the bait. There are many types of bait that can be used. Bread, flavoured dough, corn, beans are just some of the more commonly used bait."]
}  ,

{
    "name": "Copper Rockfish",
    "id": 11,
    "scientific name": "Sebastes caurinus",
    "category": "Saltwater",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwdfw.wa.gov%2Fspecies-habitats%2Fspecies%2Fsebastes-caurinus&psig=AOvVaw1SRNS1aGIPP8hUMnT9nJ64&ust=1616295364947000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCOjh7s_vve8CFQAAAAAdAAAAABAD",
    "description": ["Copper rockfish are found along the West coast of North America, from California to Alaska. Their habitat ranges from the subtidal zone to waters as deep as several hundred feet. While young copper rockfish suspend in kelp forests, large adults are usually found on the bottom. They exclusively live in waters where rocks are found, almost never on sandy bottoms. Copper rockfish feed on small fish, but they are also preyed on by lingcod and even marine mammals. Because of their aggressive feeding behaviours, copper rockfish are pretty easy to catch by simply bottom fishing with a jig or baited hook. Like other rockfish species, they are long living and slow growing so overfishing can become a problem in areas where fishing pressure is high."],
    "location":[],
    "technique":[]
}  ,

{
    "name": "English Sole",
    "id": 12,
    "scientific name": "Parophrys vetulus",
    "category":"Saltwater",
    "image":"https://www.google.com/url?sa=i&url=http%3A%2F%2Fwww.fishnbc.com%2Fspecies%2Fenglish_sole.html&psig=AOvVaw0vC1EaSFM9OWqUc4dGfIs5&ust=1616296181637000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCJj45NPyve8CFQAAAAAdAAAAABAD",
    "description": ["English sole is a common flatfish species found along the shores of North Pacific Ocean. They primarily reside in subtidal and intertidal zones, making them popular target fish for pier and beach fishermen. While their fight is no comparison to a salmon or steelhead, their table fare makes up for it. These delicious fish are best served by pan fried with breadcrumb or steamed.",
                    "These fish are generally 1 to 2lb large, sometimes smaller, depending on where you are fishing. Although they tend to be small, heavy gear is needed at times if you are fishing in areas where strong current is present. If you are fishing on piers and beaches at a bay, where current is weak, then a light spinning outfit is a very enjoyable setup for these fish.",
                    "To catch English sole successfully, you need to be fishing on the bottom. A fixed weight is needed to anchor your bait either on the muddy bottom or just above it. Typical bait used for English sole include worm, shrimp, prawn, fish pieces. Jigs and small metal lures can also yield some catches occasionally."],
    "location":[],
    "technique":[]
}  ,

{
    "name": "Eulachon",
    "id": 13,
    "scientific name": "Thaleichthys pacificus",
    "category":"Anadromous",
    "image":"https://www.google.com/url?sa=i&url=https%3A%2F%2Fen.wikipedia.org%2Fwiki%2FEulachon&psig=AOvVaw04HWGBpZw_b7el9zVb6gVW&ust=1616296397847000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCOjJkbvzve8CFQAAAAAdAAAAABAD",
    "description": ["Eulachon are also known as hooligan, ooligan or candlefish. They are anadromous, spending most of their life in the Pacific Ocean and spawn in rivers from California to Alaska. They feed on planktons, small insects and fish eggs so catching them by fishing lines is unusual. The only fishing method used to catch them is netting when they return to their natal stream during spawning. During their spawning phase, eulachon are incredibly fat, therefore the nickname candlefish was given. In the last decade, populations of eulachon have been on the decline and fishing has been closed in British Columbia. Once adult eulachon spawn in the river, they become part of white sturgeon's diet. It is the preferred bait by anglers who target white sturgeon in spring."],
    "location":[],
    "technique":[]
}  ,

{
    "name": "Kokanee",
    "id": 14,
    "scientific name": "Oncorhynchus nerka",
    "category":"Freshwater",
    "image":"https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.gofishbc.com%2FBlog%2FFishing-Tips%2FSummertime-Kokanee-Fishing.aspx&psig=AOvVaw2QsIqEkRg0QDOuLJzzSkhl&ust=1616296642361000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCPDvxLX0ve8CFQAAAAAdAAAAABAD",
    "description": ["No, not the beer, but a tiny salmonid species that has been caged within inland waters since the last glacial period. A kokanee is a landlocked sockeye salmon. Although they share the same scientific name with their saltwater cousins, they are significantly smaller as the amount of their feed is less.",
                    "Beside the size difference, kokanee are very similar to sockeye salmon. Average size of kokanee is between 10 and 14 inches, but it is not uncommon to encounter fish up to 2 to 3lb in some lakes. Their body is silver, with a straight lateral line. No distinct spots can be found on their body unlike other salmon species. Their body is not deep. Males' dorsal region becomes thicker during spawning period."],
    "location":["Many coastal and interior lakes across British Columbia offer good kokanee fishing. In the Lower Mainland, Kawkawa Lake and Alouette Lake are two main kokanee fisheries. In the Okanagan region, kokanee fisheries have made a healthy comeback in Okanagan Lake and other nearby lakes. The Freshwater Fisheries Society of BC has been developing new fisheries in this province where triploid kokanee are stocked. It is important to check the freshwater regulation synopsis for the opening and closing times of this fishery."],
    "technique":["Kokanee can be caught by bait, trolling or flyfishing. Small flies such as chironomid work well, while krill or shrimp can be deadly. Whichever method you decide to use, it is important to remember to fish where the school is. Kokanee travel at different depths based on the time of the year. In early spring, spotting them on the surface with a boat and casting in front of the school can be productive. In late spring and summer, the fish tend to hold in deeper water. Enticing them to bite is easy, but keeping them on the hook can be tough as kokanee dart, dive, leap at incredibly fast speed."]
}  ,

{
    "name": "Largemouth Bass",
    "id": 15,
    "scientific name": "Micropterus salmoides",
    "category":"Freshwater",
    "image": "https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.fws.gov%2Ffisheries%2Ffreshwater-fish-of-america%2Flargemouth_bass.html&psig=AOvVaw0ddsQrr8l8IjspNClkHfTG&ust=1616296758568000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCJC9t_r0ve8CFQAAAAAdAAAAABAD",
    "description": ["Adult largemouth bass are solitary fish, although occasionally several bass will congregate in areas with abundant food supplies. They are usually the apex predator in their habitat. They will hide between rocks, among water vegetation, or under roots and limbs of sunken trees, striking at their prey from the shadows. Bass prefer quiet, calm, and warm water but are very adaptable to other conditions. They are found in rivers, lakes, ponds, reservoirs, and steams."],
    "location":[],
    "technique":[]
}  ,

{
    "name": "Largescale Sucker",
    "id": 16,
    "scientific name": "Catostomus macrocheilus",
    "category":"Freshwater",
    "image":"https://www.google.com/url?sa=i&url=https%3A%2F%2Fblog.nature.org%2Fscience%2F2015%2F03%2F02%2Fa-sucker-myth-is-born-every-minute%2F&psig=AOvVaw3MiZSgACjzt-URnoGqpEsm&ust=1616297096327000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCPDzjon2ve8CFQAAAAAdAAAAABAI",
    "description": ["The most distinct feature of a largescale sucker is its mouth, which is located on the bottom of its head rather than the front. Like its cousins in the minnow family, it does not have an adipose fin. Its scales are carp-like, they are fairly large. The top side of the fish is often greenish-grey in colour, while its belly is usually white or creamy. A largescale sucker can reach just over half a meter long."],
    "location":["Any large salmon bearing streams and sloughs will produce largescale suckers. During the summer months, they will venture down the large systems into the estuaries. Look for sloughs, pools and shallow runs where water tends to be slow."],
    "technique":["Largescale suckers are usually by-catches when salmon fishing in rivers. They can be enticed easily by a baited hook. Bait such as dew worms, dough, salmon roe, shrimp will usually produce. A small plastic worm jig can be effective at times as well. Look for shallow, slow portions of a large river when fishing for largescale suckers. Although edible, they are very bony."]
}  ,

{
    "name": "Lingcod",
    "id": 17,
    "scientific name": "Ophiodon elongatus",
    "category":"Saltwater",
    "image":"",
    "description": ["It is not a ling, it is not a cod. A lingcod is a large species in the greenling family. They primarily inhabit in structured intertidal and subtidal zones, as well as in much deeper water where they feed on the bottom. Their long, slender body is characterized by either the brown or green colour, with orange spottings. The head is often quite large compared to the rest of the body and their jaws are lined with fang-like teeth.",
                    "Lingcod are ambush predators. They feed on crustaceans when young, but their diet changes to larger pelagic and benthic fish such as salmon and rockfish. Due to this aggressive feeding behaviour, lingcod can easily be targeted by bottom fishing with either bait or lures. Because of their teeth and the type of habitat they live in, heavy line is often needed to prevent abrasion. The most common bait used is fish pieces. Lures such as large jigs are best for jigging from a boat. In shallower water, fly fishing with large patterns is also possible.",
                    "Lingcod can grow up to over four feet. Fish caught in shallower water usually vary from one to three feet long. They are great eating fish and can be prepared by steaming, frying or grilling."],
    "location":[],
    "technique":[]
}  ,

{
    "name": "Mountain Whitefish",
    "id": 18,
    "scientific name": "Prosopium williamsoni",
    "category":"Freshwater",
    "image":"https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.takemefishing.org%2Ffish-species%2Fmountain-whitefish%2F&psig=AOvVaw1rKwZOxEVPmEfwYdo9rFqj&ust=1616298837025000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCLiznOb8ve8CFQAAAAAdAAAAABAg",
    "description": ["Mountain whitefish are generally between 0.5lb to 2lb. Fish up to 70cm or 6lb have been recorded in the past. Silver in colour, their body is generally slender and almost cylindrical. Their head is short, with a small mouth that sits under the overhung snout. Their fin colour varies between grey and yellow. One distinct characteristic that separate them from the minnow family is the presence of a adipose fin."],
    "location":["Mountain whitefish can be found in shallow lakes, clear streams and even larger silty rivers. Presence of fish is seasonal, depending on what food is available at the time. Look for waters where high volume of benthic insects, fish eggs are present."],
    "technique":["Mountain whitefish can be caught easily by spin casting, float fishing and flyfishing. Small spinners and spoons under 1/8oz imitate juvenile salmon or trout. When fished with ultralight spincast setup, they can be very effective in streams where these whitefish are feeding heavily on juvenile fish.",
                "Floatfishing with a small piece of worm or egg sac is the most productive method. The setup is fairly easy. Simply tie a small hook (size 6 to 10) a few feet below a small float. Clamp on a few split shots a foot or so above the hook. Drift the setup in moderate to slow flows will usually produce a fish or two.",
                "Flyfishermen who target coastal cutthroat trout will often encounter the odd mountain whitefish because both species predate on the same food. Small leeches, egg and minnow patterns in streams will usually work very well."]
}  ,

{
    "name": "Northern Pikeminnow",
    "id": 19,
    "scientific name": "Ptychocheilus oregonensis",
    "category":"Freshwater",
    "image":"https://www.google.com/url?sa=i&url=http%3A%2F%2Fwww.pikeminnow.org%2Fhow-to%2Fhow-to-identify-a-northern-pikeminnow%2Fhow-to-tell-a-northern-pikeminnow-from-a-peamouth&psig=AOvVaw1ndGjewn6aE7TrueqZpd0G&ust=1616299646728000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCOCwmsr_ve8CFQAAAAAdAAAAABAD",
    "description": ["Northern pikeminnow have a dark green or green-brown back and a white/cream abdomen. Their head is relatively long, approximately 22% to 23% of the total length. The eyes of adults are small. Their tail is distinctly forked. The fins are clear, however males display yellow/orange lower fins during spawning periods. Mature individuals generally have a rounded belly. Average size ranges between 30cm to 50cm or two to four pounds. However fish up to 25 pounds have been recorded, and are generally found in large interior lakes where primary productivity is high."],
    "location":["When fishing for any species, it is important to know where to look for the fish. Northern pikeminnow usually inhabit shallow portions of large rivers. They can be found in the entire Fraser River system and tributaries. When fishing in the Fraser estuary, look for northern pikeminnow close to shore near structures such as rocks, logs, eel grass, pylons and piers. Due to the strong current in the main channel, they usually choose slow water where no current exists."],
    "technique":["Prime time to fish for northern pikeminnow is between the months of May and September. However, larger fish are usually caught between June and August. Fish that are caught before June are usually less than a foot long in the Lower Fraser River.",
                 "Northern pikeminnow can be great fun on light tackle, so it is ideal to keep the line under 6lb test. Your rod should be around 6 or 7 feet long, a small spinning reel with a nice drag is all you need. There are many ways to catch them, these techniques include spinning, float fishing, bottom fishing (bar fishing) and jigging. The easiest way is definitely float fishing. All you need is a light float with properly balanced weights, accompanied by some bait such as bread, worms, or roe. Drift the float near rocks, and strikes will usually occur within seconds if fish are present. This method is usually used in calm waters where no or little current exists. Bottom fishing can also be quite effective, but you risk the chance of loosing your tackle from snags. Again, a bar rig can be used with the above mentioned bait. You weight should be light, preferably below 1oz. Bottom fishing is used in waters where current is found. The key for both methods is to keep the bait close to the bottom, where the fish are.",
                 "Spinning is also another fun method because it's challenging. Spinning has the advantage of only hooking larger fish because the smaller fish will not attack a lure half of their size. Popular lures include spoons and inline spinners. Choose your lures based on the colour of the water and the light intensity. If it's cloudy and the water is dirty, I would go for a orange or darker lure. If it's sunny and the water is fairly clear, then a silver or bright lure is used. Location is also a major factor too. If baitfish are found where you are fishing such as the Fraser River mouth, then I would go for a silver lure. Make sure the size of the lure matches the size of the fish. When spinning, keep your lure as close to the bottom as possible. Be prepare to strike as the lure gets closer to shore because that's where the fish are. The only disadvantage with spinning is that it is too 'fast' for the squawfish. Squawfish have a tendency to hesitate before they strike.",
                 "Jigging is also a popular method but again you risk the chance of snagging the bottom. Pink worms, orange worms, black worms are just some of the effective jigs. To avoid snagging, you can attach a running float to your line with a stopper on top. Like crappy fishing, this keeps the jig suspends just above the bottom and still allows you to jig as the float slides along the line."]
}  ,

{
    "name": "Pacific Halibut",
    "id": 20,
    "scientific name": "Hippoglossus stenolepis",
    "category":"Saltwater",
    "image":"https://www.google.com/url?sa=i&url=https%3A%2F%2Fthisfish.info%2Ffishery%2Fspecies%2Fpacific-halibut%2F&psig=AOvVaw2EB8-_u4akZo84yYa9GzfZ&ust=1616300027731000&source=images&cd=vfe&ved=0CAIQjRxqFwoTCNjQivyAvu8CFQAAAAAdAAAAABAD",
    "description": ["Pacific halibut have a flat, diamond-shaped body, slightly more elongated than their relatives, with a lateral line that becomes curved near their pectoral fin. They have a large mouth with pointed teeth and a square tail. On their eyed side, their body usually assumes the colour of the ocean bottom, ranging from grey to brown to almost black, often mottled with a lighter colour. Their underside is much paler, a white or off-white shade. Pacific halibut are the largest flatfish in the world, reaching a length of 2.7 metres and a weight of 300 kilograms. Females grow faster and live longer than males - the oldest recorded female was 42 years old with the oldest male at 27 years old."],
    "location":[],
    "technique":[]
}  


]